lib/tasks/dev.rake

SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? AND "coins"."mining_type_id" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://guiadobitcoin.com.br/wp-content/uploads/2020/06/bitcoin-png-min.png"], ["mining_type_id", 1], ["LIMIT", 1]]
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do
    show_spinner("Cadastrando moedas...") do
      coins = [
                {
                  description: "Bitcoin",
                  acronym: "BTC",
                  url_image: "https://guiadobitcoin.com.br/wp-content/uploads/2020/06/bitcoin-png-min.png",
                  mining_type: MiningType.find_by(acronym: 'PoW')
                },
                {
                  description: "Ethereum",
                  acronym: "ETH",
                  url_image: "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b7/ETHEREUM-YOUTUBE-PROFILE-PIC.png/480px-ETHEREUM-YOUTUBE-PROFILE-PIC.png",
                  mining_type: MiningType.all.sample
                },
                {
                  description: "Dash",
                  acronym: "DASH",
                  url_image: "https://media.dash.org/wp-content/uploads/dash-D-blue.png",
                  mining_type: MiningType.all.sample
                },
                {
                  description: "Iota",
                  acronym: "IOT",
                  url_image: "https://img.icons8.com/ios-filled/452/iota.png",
                  mining_type: MiningType.all.sample
                },
                {
                  description: "ZCash",
                  acronym: "ZEC",
                  url_image: "https://www.coinopsy.com/media/img/quality_logo/Zcash.png",
                  mining_type: MiningType.all.sample
                }
              ]

      coins.each do |coin|
        Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2020-09-15 20:09:21.365343"], ["updated_at", "2020-09-15 20:09:21.365343"]]
---
  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração...") do
      mining_types = [
        {description: "Proof of Work", acronym: "PoW"},
        {description: "Proof of Stake", acronym: "PoS"},
        {description: "Proof of Capacity", acronym: "PoC"}
      ]

      mining_types.each do |mining_type|
        MiningType.find_or_create_by!(mining_type)